JMeter/jmeter.log
2026-04-22 19:55:22,644 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-04-22 19:55:22,697 INFO o.a.j.JMeter: Loading user properties from: C:\games\New folder\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\user.properties
2026-04-22 19:55:22,698 INFO o.a.j.JMeter: Loading system properties from: C:\games\New folder\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\system.properties
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: Version 5.6.3
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: java.version=21.0.10
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: os.name=Windows 11
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: os.arch=amd64
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: os.version=10.0
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: java.awt.headless=true
2026-04-22 19:55:22,719 INFO o.a.j.JMeter: Max memory     =1073741824
2026-04-22 19:55:22,721 INFO o.a.j.JMeter: Available Processors =16
2026-04-22 19:55:22,745 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-04-22 19:55:22,745 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-04-22 19:55:22,745 INFO o.a.j.JMeter: JMeterHome=C:\games\New folder\apache-jmeter-5.6.3\apache-jmeter-5.6.3
2026-04-22 19:55:22,746 INFO o.a.j.JMeter: user.dir  =C:\Diaa\java\employee-management-system\employee-management-system
2026-04-22 19:55:22,746 INFO o.a.j.JMeter: PWD       =C:\Diaa\java\employee-management-system\employee-management-system
2026-04-22 19:55:22,755 INFO o.a.j.JMeter: IP: 192.168.1.10 Name: Diaa FullName: host.docker.internal
2026-04-22 19:55:22,806 INFO o.a.j.s.FileServer: Default base='C:\Diaa\java\employee-management-system\employee-management-system'
2026-04-22 19:55:22,808 INFO o.a.j.s.FileServer: Set new base='C:\Diaa\java\employee-management-system\employee-management-system'
2026-04-22 19:55:23,278 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-04-22 19:55:23,347 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-04-22 19:55:23,362 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-04-22 19:55:23,365 INFO o.a.j.s.SaveService: Loading file: simple-load-test.jmx
2026-04-22 19:55:23,453 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-22 19:55:23,453 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-22 19:55:23,453 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-22 19:55:23,453 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-22 19:55:23,453 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-04-22 19:55:23,453 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-04-22 19:55:23,480 INFO o.a.j.JMeter: Creating summariser <summary>
2026-04-22 19:55:23,500 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-04-22 19:55:23,501 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-04-22 19:55:23,501 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-04-22 19:55:23,508 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-04-22 19:55:23,508 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-04-22 19:55:23,635 INFO o.a.j.JMeter: Running test (1776880523635)
2026-04-22 19:55:23,661 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 50 Users Load Test
2026-04-22 19:55:23,661 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group 50 Users Load Test.
2026-04-22 19:55:23,661 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-04-22 19:55:23,663 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=10 delayedStart=false
2026-04-22 19:55:23,682 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-1
2026-04-22 19:55:23,703 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-04-22 19:55:23,703 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-04-22 19:55:23,879 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-2
2026-04-22 19:55:24,077 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-3
2026-04-22 19:55:24,225 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Diaa
2026-04-22 19:55:24,233 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-04-22 19:55:24,235 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-04-22 19:55:24,235 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-04-22 19:55:24,235 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-04-22 19:55:24,235 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-04-22 19:55:24,278 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-4
2026-04-22 19:55:24,476 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-5
2026-04-22 19:55:24,678 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-6
2026-04-22 19:55:24,873 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-7
2026-04-22 19:55:25,072 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-8
2026-04-22 19:55:25,273 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-9
2026-04-22 19:55:25,470 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-10
2026-04-22 19:55:25,669 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-11
2026-04-22 19:55:25,869 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-12
2026-04-22 19:55:26,068 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-13
2026-04-22 19:55:26,266 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-14
2026-04-22 19:55:26,466 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-15
2026-04-22 19:55:26,667 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-16
2026-04-22 19:55:26,868 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-17
2026-04-22 19:55:27,065 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-18
2026-04-22 19:55:27,264 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-19
2026-04-22 19:55:27,465 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-20
2026-04-22 19:55:27,667 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-21
2026-04-22 19:55:27,865 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-22
2026-04-22 19:55:28,066 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-23
2026-04-22 19:55:28,264 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-24
2026-04-22 19:55:28,465 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-25
2026-04-22 19:55:28,665 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-26
2026-04-22 19:55:28,866 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-27
2026-04-22 19:55:29,064 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-28
2026-04-22 19:55:29,106 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-1
2026-04-22 19:55:29,106 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-2
2026-04-22 19:55:29,106 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-1
2026-04-22 19:55:29,106 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-2
2026-04-22 19:55:29,211 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-3
2026-04-22 19:55:29,211 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-3
2026-04-22 19:55:29,264 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-29
2026-04-22 19:55:29,395 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-4
2026-04-22 19:55:29,396 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-4
2026-04-22 19:55:29,466 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-30
2026-04-22 19:55:29,601 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-5
2026-04-22 19:55:29,601 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-5
2026-04-22 19:55:29,666 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-31
2026-04-22 19:55:29,814 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-6
2026-04-22 19:55:29,814 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-6
2026-04-22 19:55:29,865 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-32
2026-04-22 19:55:29,986 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-7
2026-04-22 19:55:29,986 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-7
2026-04-22 19:55:30,010 INFO o.a.j.r.Summariser: summary +    182 in 00:00:06 =   28.6/s Avg:    11 Min:     7 Max:    70 Err:     0 (0.00%) Active: 25 Started: 32 Finished: 7
2026-04-22 19:55:30,064 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-33
2026-04-22 19:55:30,202 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-8
2026-04-22 19:55:30,202 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-8
2026-04-22 19:55:30,265 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-34
2026-04-22 19:55:30,388 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-9
2026-04-22 19:55:30,388 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-9
2026-04-22 19:55:30,465 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-35
2026-04-22 19:55:30,606 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-10
2026-04-22 19:55:30,607 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-10
2026-04-22 19:55:30,670 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-36
2026-04-22 19:55:30,794 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-11
2026-04-22 19:55:30,795 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-11
2026-04-22 19:55:30,865 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-37
2026-04-22 19:55:31,006 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-12
2026-04-22 19:55:31,006 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-12
2026-04-22 19:55:31,068 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-38
2026-04-22 19:55:31,195 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-13
2026-04-22 19:55:31,195 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-13
2026-04-22 19:55:31,265 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-39
2026-04-22 19:55:31,405 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-14
2026-04-22 19:55:31,405 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-14
2026-04-22 19:55:31,464 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-40
2026-04-22 19:55:31,600 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-15
2026-04-22 19:55:31,600 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-15
2026-04-22 19:55:31,665 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-41
2026-04-22 19:55:31,798 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-16
2026-04-22 19:55:31,799 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-16
2026-04-22 19:55:31,863 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-42
2026-04-22 19:55:31,991 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-17
2026-04-22 19:55:31,993 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-17
2026-04-22 19:55:32,064 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-43
2026-04-22 19:55:32,188 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-18
2026-04-22 19:55:32,188 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-18
2026-04-22 19:55:32,265 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-44
2026-04-22 19:55:32,384 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-19
2026-04-22 19:55:32,385 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-19
2026-04-22 19:55:32,464 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-45
2026-04-22 19:55:32,608 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-20
2026-04-22 19:55:32,608 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-20
2026-04-22 19:55:32,666 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-46
2026-04-22 19:55:32,811 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-21
2026-04-22 19:55:32,811 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-21
2026-04-22 19:55:32,865 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-47
2026-04-22 19:55:32,985 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-22
2026-04-22 19:55:32,986 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-22
2026-04-22 19:55:33,064 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-48
2026-04-22 19:55:33,205 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-23
2026-04-22 19:55:33,205 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-23
2026-04-22 19:55:33,264 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-49
2026-04-22 19:55:33,380 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-24
2026-04-22 19:55:33,380 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-24
2026-04-22 19:55:33,465 INFO o.a.j.t.JMeterThread: Thread started: 50 Users Load Test 1-50
2026-04-22 19:55:33,602 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-25
2026-04-22 19:55:33,602 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-25
2026-04-22 19:55:33,781 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-26
2026-04-22 19:55:33,781 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-26
2026-04-22 19:55:33,982 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-27
2026-04-22 19:55:33,982 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-27
2026-04-22 19:55:34,191 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-28
2026-04-22 19:55:34,191 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-28
2026-04-22 19:55:34,396 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-29
2026-04-22 19:55:34,396 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-29
2026-04-22 19:55:34,609 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-30
2026-04-22 19:55:34,610 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-30
2026-04-22 19:55:34,822 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-31
2026-04-22 19:55:34,823 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-31
2026-04-22 19:55:35,004 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-32
2026-04-22 19:55:35,004 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-32
2026-04-22 19:55:35,233 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-33
2026-04-22 19:55:35,234 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-33
2026-04-22 19:55:35,395 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-34
2026-04-22 19:55:35,395 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-34
2026-04-22 19:55:35,610 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-35
2026-04-22 19:55:35,610 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-35
2026-04-22 19:55:35,839 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-36
2026-04-22 19:55:35,839 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-36
2026-04-22 19:55:36,007 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-37
2026-04-22 19:55:36,007 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-37
2026-04-22 19:55:36,218 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-38
2026-04-22 19:55:36,218 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-38
2026-04-22 19:55:36,391 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-39
2026-04-22 19:55:36,391 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-39
2026-04-22 19:55:36,613 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-40
2026-04-22 19:55:36,614 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-40
2026-04-22 19:55:36,845 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-41
2026-04-22 19:55:36,845 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-41
2026-04-22 19:55:37,027 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-42
2026-04-22 19:55:37,027 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-42
2026-04-22 19:55:37,208 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-43
2026-04-22 19:55:37,208 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-43
2026-04-22 19:55:37,419 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-44
2026-04-22 19:55:37,419 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-44
2026-04-22 19:55:37,651 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-45
2026-04-22 19:55:37,651 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-45
2026-04-22 19:55:37,842 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-46
2026-04-22 19:55:37,842 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-46
2026-04-22 19:55:38,056 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-47
2026-04-22 19:55:38,056 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-47
2026-04-22 19:55:38,223 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-48
2026-04-22 19:55:38,223 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-48
2026-04-22 19:55:38,415 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-49
2026-04-22 19:55:38,415 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-49
2026-04-22 19:55:38,638 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users Load Test 1-50
2026-04-22 19:55:38,638 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users Load Test 1-50
2026-04-22 19:55:38,639 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-04-22 19:55:38,641 INFO o.a.j.r.Summariser: summary +    318 in 00:00:09 =   36.8/s Avg:    10 Min:     7 Max:    53 Err:     0 (0.00%) Active: 0 Started: 50 Finished: 50
2026-04-22 19:55:38,672 INFO o.a.j.r.Summariser: summary =    500 in 00:00:15 =   33.3/s Avg:    10 Min:     7 Max:    70 Err:     0 (0.00%)